songs/app/Controllers/MusicController.php

SELECT *
FROM `playlists`
SELECT *
FROM `music`
---
    public function jemalyn()
    {
        $data['playlists'] = $this->playlists->findAll();
        $data['music'] = $this->music->findAll();