admin/app/Controllers/MainController.php

UPDATE `prod` SET `Product_Image` = '24', `Product_Description` = 'technology', `Product_Name` = 'cellphone', `Product_Price` = '5000', `Product_Category` = 'Drinks', `Product_Quantity` = '1'
WHERE `id` = '24'
---
public function update($id)
{
    $data = [
                'Product_Image'=>$this->request->getVAr('Product_Image'),
                'Product_Description'=>$this->request->getVAr('Product_Description'),
                'Product_Name'=>$this->request->getVAr('Product_Name'),
                'Product_Price'=>$this->request->getVAr('Product_Price'),
                'Product_Category'=>$this->request->getVAr('Product_Category'),
                'Product_Quantity'=>$this->request->getVAr('Product_Quantity'),
    ];
    if ($this->request->getVar('id')) {
        $this->admin->where('id', $this->request->getVar('id'))->set($data)->update();